driver-tests/bpelse/misc/MiscJbi/test/SunService/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sun="http://localhost/prjTask/SunService">
  <soapenv:Body>
    <sun:SetTaakVerwerktRequest>set</sun:SetTaakVerwerktRequest>
  </soapenv:Body>
</soapenv:Envelope>